/********************************************************************
* Copyright (C) 2022 by Elektron Research and Production Company
* ALL RIGHTS RESERVED.
*********************************************************************
*
* Project: Graphic Workstation (6G_DIRA_3D)
*
* File Name: common/loggertypes.h
*
* Description: Файл с описанием всех типов и структур данных для
*           для модуля ведения журнала работы приложения (модуля)
*
* Notes: Any remarks or cautions
*
* History:
*	20 Sep 2022	Igor Popovich: Created
*
********************************************************************/
#ifndef LOGGERTYPES_H
#define LOGGERTYPES_H

//! Namespace for Graphical Workstation of the 6G_DIRA_3D project
namespace DIRA_3D_GW {

/**
 * \enum Перечисление поодерживаемых уровней ведения журнала
 */
enum LoggerLevel
{
    System   = -1,  // Системные сообщения, которые всегда пишется в файл журнала
                    // например процесс инициализации или завершения работы системы
    Critical = 0,   // Сообщения о ситуации приводящей или условно приводящей к аварийному
                    // завершению приложения
    Error = 1,      // Сообщения об ошибках. Все участки кода, в которые не должны попадать
                    // при штатной работе модуля
    Warning = 2,    // Сообщения в ситуациях, на которые стоит обратить внимание.
    Info = 3,       // Информационные сообщения. Вспомогательная информация позволяющая
                    // контролировать работу модуля. Например, начало выполнения такой-то операции.
                    // В результате выполнения операции получилось то-то и то-то
    Debug = 4,      // Отладочные сообщения. Достаточно подробное логгирование процесса работы.
    Developer = 5,  // Логгирование для разработчика. Например, свойства объектов, dump памяти и т.п.
};

}   // End namespace DIRA_3D_GW

#endif // LOGGERTYPES_H
